## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: gcp/prod
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # google_identity_platform_oauth_idp_config.oauth_idp_config will be created
+   resource "google_identity_platform_oauth_idp_config" "oauth_idp_config" {
+       client_id     = "argocd"
+       client_secret = (sensitive)
+       display_name  = "ArgoCD"
+       enabled       = true
+       id            = (known after apply)
+       issuer        = "https://accounts.google.com"
+       name          = "ArgoCD"
+       project       = (known after apply)
    }

  # module.terraform-google-billing-budget.google_billing_budget.budget[0] will be created
+   resource "google_billing_budget" "budget" {
+       billing_account = "0150C1-937237-2C8418"
+       display_name    = "global-alert"
+       id              = (known after apply)
+       name            = (known after apply)

+       amount {
+           specified_amount {
+               currency_code = "USD"
+               units         = "300"
            }
        }

+       budget_filter {
+           calendar_period        = (known after apply)
+           credit_types           = (known after apply)
+           credit_types_treatment = (known after apply)
+           labels                 = (known after apply)
+           projects               = (known after apply)
+           services               = (known after apply)
+           subaccounts            = (known after apply)

+           custom_period {
+               end_date {
+                   day   = (known after apply)
+                   month = (known after apply)
+                   year  = (known after apply)
                }

+               start_date {
+                   day   = (known after apply)
+                   month = (known after apply)
+                   year  = (known after apply)
                }
            }
        }

+       threshold_rules {
+           spend_basis       = "CURRENT_SPEND"
+           threshold_percent = 1
        }
+       threshold_rules {
+           spend_basis       = "CURRENT_SPEND"
+           threshold_percent = 0.5
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:gcp/prod workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 0.20 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| gcp/prod | default | 0.00 | 0.20 | 0.20|
| | **Total** | **0.00** | **0.20** | **0.20** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
